# 4. Redis Data Modeling

---

# 4.1 키-밸류(Key-Value) 데이터 모델링 개념

## 4.1.1 용어 설명

- `TABLE`: 데이터를 저장하는 논리적 구조
- `FIELD`/`ELEMENT`: 하나의 테이블을 구성하는 요소 (=`COLUMN`)
- 하나의 `KEY`와 하나 이상의 필드 또는 엘리먼트로 구성
- `HYPERLOGLOGS` 데이터 속성을 통해 원하는 조건의 데이터 저장, 관리 가능 (=`CHECK`)

## 4.1.2 Redis 데이터 모델링 가이드라인

### 1) Hash 데이터 모델

- 관계형 DB의 부모-자식(Parent-Child) 테이블과 유사
- 예) 주문 테이블 - 운송 테이블: 주문 테이블이 먼저 생성되어야 운송 테이블이 생성될 수 있는 데이터 구조
- Hash 모델로 구현

### 2) List 데이터 모델

- 관계형 DB의 마스터-디테일(Master-Detail) 테이블과 유사
- 예) 주문전표: 주문 공통 테이블이 Master 테이블, 주문 상세 테이블이 Detail 테이블. Master와 Detail 테이블을 합치면 주문전표라는 완전한 데이터 구조.
- Hash-List 모델로 구현

### 3) Set/Sorted Set 데이터 모델

- 관계형 DB의 계층형(Tree Structure) 테이블과 유사
- 예) 사원 테이블에서 사원번호가 식별 키이고 상관사원번호 컬럼이 같은 테이블 내 사원번호를 참조 (Self-Reference)
- Set/Sorted Set 모델로 구현

### 4) HyperLogLogs 데이터 모델

- 관계형 DB의 Check-제약조건과 유사
- 해당 컬럼에 원치 않는 데이터가 입력 및 변경되는 것을 방지
- HyperLogLogs 모델로 구현

## 4.1.3 데이터 모델

### 1) Hash-Hash 모델

- 예) 주문테이블 - 운송테이블

```bash
> hmset order:201809123 customer_name "W&S" emp_name "Magee" total 601100 payment_type "Credit" order_filled "Y"
OK
> hgetall order:201809123
 1) "customer_name"
 2) "W&S"
 3) "emp_name"
 4) "Magee"
 5) "total"
 6) "601100"
 7) "payment_type"
 8) "Credit"
 9) "order_filled"
10) "Y"
> hmset translate:201809123 translate_no 6723120 customer_name "W&S" zip_code 15881 address "Seoul Song[a 58" order_amount 60100
OK
> hgetall translate:201809123
 1) "translate_no"
 2) "6723120"
 3) "customer_name"
 4) "W&S"
 5) "zip_code"
 6) "15881"
 7) "address"
 8) "Seoul Song[a 58"
 9) "order_amount"
10) "60100"
```

### 2) Hash-List 모델

- 예) 주문공통 테이블 - 주문상세 테이블

```bash
> hmset order:201809123 customer_name "W&S" emp_name "Magee" total 601100 payment_type "Credit" order_filled "Y"
OK
> hgetall order:201809123
 1) "customer_name"
 2) "W&S"
 3) "emp_name"
 4) "Magee"
 5) "total"
 6) "601100"
 7) "payment_type"
 8) "Credit"
 9) "order_filled"
10) "Y"
> lpush order_detail:201809123 "<item_id>1</item_id><product_name>Bunny Boots</product_name><item_price>135</item_price>" "<item_id>2</item_id><product_name>ProSki Boots</product_name><item_price>380</item_price>"
(integer) 2
> lrange order_detail:201809123 0 1
1) "<item_id>2</item_id><product_name>ProSki Boots</product_name><item_price>380</item_price>"
2) "<item_id>1</item_id><product_name>Bunny Boots</product_name><item_price>135</item_price>"
```

### 3) List-List 모델

- 예) 제품 테이블 - 카테고리 테이블
- N:M 관계

```bash
> lpush product:p1001 "{ pname : 'Asus 1', cname : { [ cname1: c1000, cname2 : c1002, cname3 : c1002 ] }"
(integer) 1
> lrange product:p1001 0 -1
1) "{ pname : 'Asus 1', cname : { [ cname1: c1000, cname2 : c1002, cname3 : c1002 ] }"
> lpush category:c1000 "{ cname : 'Tablet', pname : { [ pname1: p1001, pname2 : p1002, pname3 : p1002 ] }"
(integer) 1
> lrange category:c1000 0 -1
1) "{ cname : 'Tablet', pname : { [ pname1: p1001, pname2 : p1002, pname3 : p1002 ] }"
```

### 4) Set/Sorted Set-List 모델

- 계층 구조 테이블
- 예) ancestor_id, parent_id, chlidlen_id 필드는 id 필드 값을 참조

```bash
> SADD employee "id:1101, name:YSRoh, age:23, telephone:01012345678" 
"id:1102, name:Ybigta, age:25, parent_id:1101, childlen_id:1103" 
"id:1103, name:nosql, age:27, parent_id:1102, ancestor_id:1101"
(integer) 3
> SMEMBERS employee
1) "id:1101, name:YSRoh, age:23, telephone:01012345678"
2) "id:1103, name:nosql, age:27, parent_id:1102, ancestor_id:1101"
```

---

# 4.2 논리적 DB 설계

- `스트라이핑(Striping)`: 데이터 성격, 비즈니스 룰, 관리 방안, 성능 이슈에 따라 여러 개의 논리적 DB에 분산 저장
- `데이터 백업 및 복구 측면`에서 여러 개의 DB로 분산 생성하는 것이 유리
- 데이터 입력, 수정, 삭제, 조회 시 발생하는 다양한 `락(Lock)`현상을 최소화하기 위해 여러 개의 DB로 분산 설계 및 구축

→ CONF 환경설정 파일의 `database` 파라미터로 DB 개수를 결정

→ redis-cli.exe 쉘에서 `SELECT`문으로 해당 데이터베이스로 이동

---

# 4.3 swapDB 설계

- 빅데이터의 분류(Sorting) 작업 시 메모리 부족으로 인해 발생하는 일시적인 성능 지연 문제를 보완하기 위해 Redis 4.0부터 swapDB 기능을 제공
- 관계형 DB의 임시 테이블스페이스/임시 데이터베이스와 유사

```bash
127.0.0.1:6379> select 1
OK
127.0.0.1:6379[1]> swapdb 0 1
OK
127.0.0.1:6379[1]> select 0
OK
127.0.0.1:6379> swapdb 0 1
OK
127.0.0.1:6379> select 2
OK
127.0.0.1:6379[2]> set 1 "hi"
OK
127.0.0.1:6379[2]> keys *
1) "1"
127.0.0.1:6379[2]> select 1
OK
127.0.0.1:6379[1]> keys *
(empty array)
127.0.0.1:6379[1]> swapdb 1 2
OK
127.0.0.1:6379[1]> keys *
1) "1"
```